Privet

// Задача 10: Напишите программу, которая принимает на вход трёхзначное число
//  и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1



// int num = new Random().Next(100,1000);

// Console.WriteLine(num);

// int num1=(num%100);
// int result = (num1/10); 

// Console.WriteLine(result);

// _________________________________________________

// Задача 13: Напишите программу, которая выводит третью цифру заданного 
// числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6


// int num = new Random ().Next(10,10000);

// int num=48;
// Console.WriteLine(num);

// string num1 = Convert.ToString(num);

// if (num1.Length>2)
// {
//     Console.WriteLine(num1[2]);
// }
// else
// {
//     Console.WriteLine("третий цифры нет");
// }

// ____________________________________________________

// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день 
// недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

int num = new Random ().Next(1,8);

Console.WriteLine(num);

if ((num==6)||(num==7))
{
    Console.WriteLine("yes");
}
else
{
    Console.WriteLine("no");
}
